*&---------------------------------------------------------------------*
*& Include          MZD17_EXAM4_O01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&  status 및 제목 설정.
*&---------------------------------------------------------------------*
MODULE status_0100 OUTPUT.
  SET PF-STATUS 'STATUS_0100'.    "BACK, EXIT, CANCEL 버튼 설정
  SET TITLEBAR 'TITLE_0100'.      "[CL4-D17] 영화 예매 시스템
ENDMODULE.

*&---------------------------------------------------------------------*
*& Module CLEAR_OK_CODE OUTPUT
*&---------------------------------------------------------------------*
*& ok_code 초기화.
*&---------------------------------------------------------------------*
MODULE clear_ok_code OUTPUT.
  CLEAR ok_code.
ENDMODULE.

*&---------------------------------------------------------------------*
*& Module MOVE_TO_DYNP OUTPUT
*&---------------------------------------------------------------------*
*& 조건에 맞게 뽑아온 데이터 화면으로 옮기기.
*&---------------------------------------------------------------------*
MODULE move_to_dynp OUTPUT.
  MOVE-CORRESPONDING gs_customer TO ztd17_customer.
ENDMODULE.

*&---------------------------------------------------------------------*
*& Module FILL_DYNNR OUTPUT
*&---------------------------------------------------------------------*
*& tab의 subscreen 설정을 위한 스크린 변수(gv_dynnr) 설정
*&---------------------------------------------------------------------*
MODULE fill_dynnr OUTPUT.
  CASE tab1-activetab.
    WHEN 'CUSTOMER_INFO'.
      "회원 정보를 눌렀을 때 subscreen 번호 110 지정.
      gv_dynnr = 110.
    WHEN 'BOOK'.
      "영화 예매 눌렀을 떄 subscrren 번호 120 지정.
      gv_dynnr = 120.
    WHEN OTHERS.
      "프로그램 실행 시 초기 tab 설정.
      tab1-activetab = 'CUSTOMER_INFO'.
      gv_dynnr = 110.
  ENDCASE.
ENDMODULE.

*&---------------------------------------------------------------------*
*& Module MOVE_TO_DYNP_0120 OUTPUT
*&---------------------------------------------------------------------*
*& 120 subscreen에서 입력에 따라 뽑아온 데이터 화면으로 옮기기.
*&---------------------------------------------------------------------*
MODULE move_to_dynp_0120 OUTPUT.
  "영화 정보 화면으로 옮기기.
  MOVE-CORRESPONDING gs_movie TO ztd17_movie.

*  "극장 정보 화면으로 옮기기.
  MOVE-CORRESPONDING gs_theater to ztd17_theater.

*  "상영 정보 화면으로 옮기기.
  MOVE-CORRESPONDING gs_showtime to ztd17_showtime.
ENDMODULE.